AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/Renault_ВыгрузкаДанных/Ext/Module.bsl
Процедура ВыгрузитьОстаткиАвтомобилейВБазуДилерскийПортал(Параметры1 = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСоединения = DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения();
	
	ДанныеДляОтправки = ПолучитьСписокАвтомобилейНаОстатках();
	
	Для Каждого СтрокаСтруктуры Из ДанныеДляОтправки Цикл
		СписокАвто = СтрокаСтруктуры.Значение;
		
		Если СписокАвто.Количество() > 0 Тогда
			Ответ = Ложь;
			
			Если DMS_DataExchange.sendMessage(ПараметрыСоединения,, "DMS_Tariff.getData", DMS_DataExchange.newPackage(СписокАвто), Ответ) Тогда
				Если ТипЗнч(Ответ) = Тип("Строка") И Найти(Ответ, "arc") Тогда
					Ответ = ValueFromStringInternal(Mid(Ответ,4)).Get();
				КонецЕсли;		
			КонецЕсли;	
			
			Если ТипЗнч(Ответ) = Тип("Строка") Тогда
				ЗаписьЖурналаРегистрации("DMS_StockBalance", УровеньЖурналаРегистрации.Ошибка,,, Ответ);
				
			ИначеЕсли ТипЗнч(Ответ) = Тип("Булево") И Ответ <> Истина Тогда
				Ответ = СтрокаСтруктуры.Ключ
				+ Символы.ПС + "Произошла ошибка во время HTTP обмена ""DMS_StockBalance"", между базами [Дилерская система]-[Gate]-[Дилерский портал]!"
				+ Символы.ПС + "Проверьте ошибки в базах [Gate] и [Дилерский портал], в журнале регистрации, по событию ""DMS_StockBalance""."
				+ Символы.ПС + "Проблемы могут быть связанны с подключением к базам, с обработкой данных, с отправкой данных.";
								
				ЗаписьЖурналаРегистрации("DMS_StockBalance", УровеньЖурналаРегистрации.Ошибка,,, Ответ);
			КонецЕсли;
			РегистрыСведений.DMS_МониторингРегламентныхЗаданий.ЗавершениеЗадания(
			ПредопределенноеЗначение("Справочник.DMS_НастройкаРегламентныхЗаданий.ВыгрузкаОстатковАвтомобилейВДилерскийПортал"),
			ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСписокАвтомобилейНаОстатках()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВозврата = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
		|			&ДатаСреза,
		|			Автомобиль.VIN <> """"
		|				И СкладКомпании <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
		|				И СкладКомпании.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)) КАК ОстаткиАвтомобилейОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.VIN,
		|	CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка.BIR_Distri КАК BIR,
		|	ВЫРАЗИТЬ(CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка.Бир_ЛМТ КАК СТРОКА(8)) КАК BIR_Lmt
		|ПОМЕСТИТЬ ВТ_ИтоговыеДанные
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК CRM_ДилерскиеЦентрыПодразделенияОрганизации
		|		ПО ВТ_Остатки.Подразделение = CRM_ДилерскиеЦентрыПодразделенияОрганизации.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтоговыеДанные.VIN КАК VIN,
		|	ВТ_ИтоговыеДанные.BIR КАК BIR,
		|	ВТ_ИтоговыеДанные.BIR_Lmt КАК BIR_Lmt
		|ИЗ
		|	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
		|		ПО ВТ_ИтоговыеДанные.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN
		|ГДЕ
		|	ВТ_ИтоговыеДанные.BIR_Lmt <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	BIR_Lmt,
		|	VIN
		|ИТОГИ
		|	МАКСИМУМ(BIR)
		|ПО
		|	BIR_Lmt";
	
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда		
		ВыборкаBIR = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаBIR.Следующий() Цикл
			СписокVIN = Новый Массив;
			СписокVIN.Добавить("");
			СписокVIN.Добавить(СокрЛП(ВыборкаBIR.BIR));
			СписокVIN.Добавить(СокрЛП(ВыборкаBIR.BIR_Lmt));
			
			СчетVIN = 0;
			ВыборкаVIN = ВыборкаBIR.Выбрать();
			Пока ВыборкаVIN.Следующий() Цикл
				СписокVIN.Добавить(СокрЛП(ВыборкаVIN.VIN));
				
				СчетVIN = СчетVIN + 1;
			КонецЦикла;
			
			Если СчетVIN > 0 Тогда
				СтруктураВозврата.Вставить("BIR_" + СписокVIN[2], СписокVIN);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
